{
  "subject": "VCM",
  "scrapedAt": 1768434605347,
  "courseCount": 38,
  "courses": {
    "VCM 513": [
      "Science of Health Homeostasis",
      {
        "A": [
          "75045",
          [
            [
              119,
              "W",
              "ONLINE",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "B": [
          "75756",
          [
            [
              119,
              "W",
              "ONLINE",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "C": [
          "77984",
          [
            [
              29,
              "W",
              "Location Pending",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual animals and populations are continually exposed to internal and external hardships and to specific health challenges. To live healthy and productive lives, animals must resist and/or adapt to a wide range of health ordeals and difficulties. This ability or capacity of an individual to adapt to change and challenge is termed homeostasis and is a key concept in the design and implementation of health management strategies. Prerequisite: Students must complete VCM 507 and VCM 509 maintaining a B or better to advance to VCM 513. All students must have a bachelor’s degree with a 3.0 GPA or better.",
      []
    ],
    "VCM 522": [
      "Adv Comp Theriogenology",
      {
        "A": [
          "37718",
          [
            [
              64,
              "R",
              "Location Pending",
              3,
              [
                "Frederico Canisso, I",
                "Garrett, E",
                "Podico, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced study on the principles and practice of theriogenology in domestic and non-domestic animals.",
      []
    ],
    "VCM 501": [
      "Zoological Medicine Seminar",
      {
        "A": [
          "49726",
          [
            [
              105,
              "W",
              "Location Pending",
              3,
              [
                "Langan, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Discussion of selected topics and literature pertaining to zoological, wildlife and aquatic animal medicine and presentation of a formal seminar.",
      []
    ],
    "VCM 514": [
      "Science of Health Evaluation",
      {
        "A": [
          "75046",
          [
            [
              119,
              "W",
              "ONLINE",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "B": [
          "77222",
          [
            [
              119,
              "W",
              "ONLINE",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ],
        "C": [
          "77985",
          [
            [
              77,
              "W",
              "Location Pending",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Students will apply their pre-existing, foundational knowledge of anatomy, physiology, immunology, microbiology, and pathology in evaluating and solving health failure problems in the major body systems. Participants will learn to ask thoughtful, focused, and purposeful questions when collecting clinical data, and how to use a problem-oriented approach in evaluating health problems, constructing inquiry pathways, and in designing therapeutic and disease management strategies. Prerequisite: Students must complete VCM 507, VCM 509, VCM 513 maintaining a B or better to advance to VCM 514. All students must have a bachelor’s degree with a 3.0 GPA or better.",
      []
    ],
    "VCM 508": [
      "Trans Mol Path Veterinary Dz",
      {
        "A": [
          "61090",
          [
            [
              120,
              "MWF",
              "Location Pending",
              3,
              [
                "Fan, T",
                "Rosser, M",
                "Schnelle, A",
                "Terio, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Translation Molecular Pathogenesis of Veterinary Disease (Trans Mol Path Veterinary Dz) equips graduate students with knowledge and skills needed to understand molecular pathologic processes and determine how they translate to clinical manifestations of disease. The pathologic processes to be covered including those involved in cellular response to stress, inflammation, tissue repair, circulation and hemodynamics, immunity, cancer, and infectious disease. Translational associations that link pathologic mechanisms with disease manifestations commonly encountered in companion animal veterinary practice will be emphasized and will promote comprehensive bench-to-bedside learning.",
      []
    ],
    "VCM 506": [
      "Topics in Pathophysiology",
      {
        "A": [
          "52776",
          [
            [
              50,
              "M",
              "Location Pending",
              3,
              [
                "Haraschak, J",
                "Kennedy, C",
                "Long, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced review and discussion of topics pertaining to the physiology/pathophysiology, diagnosis, and current therapies for diseases in the field of small animal emergency and critical care medicine. May be repeated to a maximum of 6 hours.",
      []
    ],
    "VCM 503": [
      "Current Lit in Equine Med Surg",
      {
        "A": [
          "48513",
          [
            [
              50,
              "M",
              "243 Veterinary Teaching Hospital",
              3,
              [
                "Austin, S",
                "Gutierrez Nibeyro, S"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "This course will use current primary literature in the fields of equine medicine and surgery as a gateway to discussion. Current literature will be reviewed, critiqued, and discussed in the context of current equine clinical practice. Students are expected to be graduate veterinarians with a thorough understanding of equine medical and surgical concepts before enrolling in the course.",
      []
    ],
    "VCM 515": [
      "The Dynamics of the Immune System in the Maintenance and Defense of Health",
      {
        "A": [
          "77223",
          [
            [
              65,
              "M",
              "ONLINE",
              3,
              [
                "Chase, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Introducing the immune system functions in health maintenance. The content will train students to consider the role of the immune system in animal responses to various health challenges and prompt them to develop an integrated, science-based approach in solving health problems by applying their knowledge of immune system structure and function in comprehending how the body detects, communicates, regulates, and corrects pathophysiologic perturbations.",
      []
    ],
    "VCM 524": [
      "Effective Biomedical Teacher",
      {
        "A": [
          "62811",
          [
            [
              30,
              "R",
              "ARR Vet Med Basic Sciences Bldg",
              3,
              [
                "Aldridge, B",
                "Aldridge, R"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides current or future university-level biomedical educators with the knowledge, motivation and proficiencies needed to apply the most recent developments in higher education to their teaching. The overall aim of the course is to cultivate an informed, passionate and adventurous approach to teaching and learning in participants. This will be achieved by fostering new thinking about teaching and learning, and by encouraging collaborative and cooperative learning between the class members.",
      []
    ],
    "VCM 517": [
      "Imaging Anatomy",
      {
        "A": [
          "78261",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Aldridge, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Guiding students through clinically relevant anatomy using diagnostic imaging. All body systems are covered in this comprehensive course. The basic principles behind imaging modalities, image acquisition, and radiation safety are covered to encourage learners to consider how tissue structure and function apply to anatomy and the interpretation of diagnostic images.",
      []
    ],
    "VCM 536": [
      "ECC Journal Topics",
      {
        "A": [
          "57849",
          [
            [
              50,
              "T",
              "Location Pending",
              3,
              [
                "Haraschak, J",
                "Kennedy, C",
                "Long, E"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Review and discuss current veterinary literature pertaining to small animal emergency and critical care medicine.",
      []
    ],
    "VCM 535": [
      "Small Animal Internal Medicine Book Club",
      {
        "A": [
          "69660",
          [
            [
              50,
              "W",
              "250 Veterinary Teaching Hospital",
              3,
              [
                "Barko, P",
                "Bruner, J",
                "Gal, A",
                "Reinhart Dungar, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Read and review a veterinary medical textbook in preparation for the ACVIM General and Specialty Exams. At each class meeting, we will discuss the material in the assigned chapters.",
      []
    ],
    "VCM 540": [
      "Conservation and Ecosystem Health",
      {
        "A": [
          "73468",
          [
            [
              15,
              "TR",
              "E-080 Veterinary Teaching Hospital",
              3,
              [
                "Sander, W"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ],
        "B": [
          "75780",
          [
            [
              15,
              "TR",
              "ONLINE",
              3,
              [
                "Sander, W"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides professional students and graduate students with an introduction to the use of medical reasoning and technology in the investigation of problems related to conservation biology and ecosystem health. Students will have a variety of lecturers from across the university and some outside speakers in a seminar format use case examples and discussions of current problems. The survey of topics will provide a better understanding of the challenges in ecosystem health and a basis for further in-depth study for their careers.",
      []
    ],
    "VCM 542": [
      "Ocular Pathology",
      {
        "A": [
          "63538",
          [
            [
              50,
              "W",
              "Location Pending",
              3,
              [
                "Samuelson, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Same as PATH 542. See PATH 542.",
      []
    ],
    "VCM 585": [
      "Current Lit Sm Anim Medicine",
      {
        "A": [
          "37722",
          [
            [
              50,
              "R",
              "217 Veterinary Teaching Hospital",
              3,
              [
                "Barko, P",
                "Bruner, J",
                "Gal, A",
                "Reinhart Dungar, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          3,
          0,
          [],
          -1
        ]
      },
      [],
      "Participants will discuss and analyze current veterinary journal articles which pertain to small animal internal medicine.",
      []
    ],
    "VCM 561": [
      "Biosecurity in Livestock Systems",
      {
        "A": [
          "73136",
          [
            [
              22,
              "W",
              "ONLINE",
              3,
              [
                "Lowe, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "This is an 8-week graduate level course that covers the principles of biosecurity. The course will allow students to design a comprehensive protocol for a given site. This course emphasizes how to optimize interventions in swine production systems to minimize the economic impact of infectious disease. The instructors assume that enrolled students have foundational knowledge of pathogens and swine system design and operations. Prerequisite: DVM or equivalent. Restricted to graduate students only.",
      []
    ],
    "VCM 584": [
      "Current Concepts Comp Surgery",
      {
        "A": [
          "37721",
          [
            [
              50,
              "M",
              "E-080 Veterinary Teaching Hospital",
              3,
              [
                "Moran, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          0,
          0,
          [],
          -1
        ],
        "LA": [
          "60959",
          [
            [
              50,
              "RF",
              "243 Veterinary Teaching Hospital",
              3,
              [
                "Gray, S",
                "Gutierrez Nibeyro, S",
                "McCoy, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Advanced study of topics concerning the pathophysiology, diagnosis, and current therapy of diseases which are treated with surgical procedures.",
      []
    ],
    "VCM 577": [
      "Advanced Large Animal Medicine",
      {
        "A": [
          "37720",
          [
            [
              50,
              "W",
              "243 Veterinary Teaching Hospital",
              3,
              [
                "Foreman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "A seminar series devoted to intense study of pathophysiologic and current therapeutic aspects of selected topics in large animal internal medicine.",
      []
    ],
    "VCM 592": [
      "Special Problems",
      {
        "": [
          "10321",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "ANE": [
          "60094",
          [
            [
              19,
              "W",
              "Location Pending",
              3,
              [
                "Martins, F",
                "Sharping, S",
                "Strahl-Heldreth, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          6,
          0,
          [],
          -1
        ],
        "BAA": [
          "29285",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Aldridge, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "BAB": [
          "29282",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Aldridge, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Basic and applied study including orientation and research on pertinent initial and continuing problems in the student's area of interest.",
      []
    ],
    "VCM 593": [
      "Adv Topics Vet Clin Med",
      {
        "": [
          "10324",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ],
        "ANE": [
          "60095",
          [
            [
              64,
              "M",
              "ONLINE",
              3,
              [
                "Martins, F",
                "Sharping, S",
                "Strahl-Heldreth, D"
              ],
              -1,
              -1,
              -1
            ]
          ],
          4,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Instruction in advanced diagnosis, therapeutic modalities, and research methodologies in the areas of small animal internal medicine, small animal surgery, equine and food animal medicine and surgery, ophthalmology, theriogenology, radiology, and clinical pharmacology.",
      []
    ],
    "VCM 608": [
      "Equine Veterinary Husbandry",
      {
        "E": [
          "53825",
          [
            [
              15,
              "TR",
              "1261 Vet Med Basic Sciences Bldg",
              3,
              [
                "Foreman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to familiarize veterinary students with the basic principles of equine husbandry, including biosecurity, infectious disease prevention, anti-parasite programs, dental care, transport, and nutrition.",
      []
    ],
    "VCM 598": [
      "Manuscript Research",
      {
        "": [
          "51913",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          12,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Independent research to fulfill requirement for non-thesis alternative in Master of Science Program.",
      []
    ],
    "VCM 595": [
      "MVS Integrative Learning Experience",
      {
        "B": [
          "71850",
          [
            [
              65,
              "R",
              "ONLINE",
              3,
              [
                "Blair, B",
                "Rutherford, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          7,
          0,
          [],
          -1
        ],
        "C": [
          "76278",
          [
            [
              65,
              "R",
              "Location Pending",
              3,
              [
                "Blair, B",
                "Rutherford, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          8,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "The Master of Veterinary Science (MVS) Integrative Learning Experience provides students with an opportunity to synthesize, integrate, and apply knowledge and skills acquired in MVS approved coursework. Students will work on a comprehensive project simulating an experience in a professional setting. The capstone project must integrate theory and practical experience, draw upon students’ originality and creativity within appropriate scope, and stretch their research, analytical, writing, critical thinking, and other intellectual abilities. Course registration is restricted to MVS degree seeking students and requires approval from the instructor. The comprehensive capstone project will take a year to complete requiring students to register for this course the last two semesters of the degree program.",
      []
    ],
    "VCM 627": [
      "Equine Infectious Disease",
      {
        "E": [
          "55873",
          [
            [
              30,
              "M",
              "250 Veterinary Teaching Hospital",
              3,
              [
                "Austin, S",
                "Foreman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides an in-depth review of common equine infectious diseases (viral, bacterial, parasitic) according to body systems. Primarily uses a lecture-based format to review the key aspects of disease pathogenesis, common clinical signs and most appropriate diagnostic test(s) for pathogen identification. Lectures are followed by several (3-4) cases that the lecturer will review in class with the students. These cases will be designed to emphasize the essential aspects of the different infectious diseases and generate critical thinking by the students with regards to developing an appropriate diagnostic plan.",
      []
    ],
    "VCM 628": [
      "The Healer's Art",
      {
        "A": [
          "73198",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Gray, S",
                "Hague, D",
                "Pavlovsky, G"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Creates time and space for veterinary medicine professional students to reflect and remember what it was that brought them to this field and why they want to do this work. The course provides a safe place for students to explore their feelings, passions, struggles, and aspirations with other classmates and faculty members. This is a class focused on giving students tools to build resiliency and foster self-awareness and growth. By addressing topics such as self-confidence and interpersonal relationships during veterinary school, this course gives students the opportunity to learn how to cope with some of the challenges as they occur to combat compassion fatigue, burnout, and overall job dissatisfaction.",
      []
    ],
    "VCM 661": [
      "Advanced Equine Lameness",
      {
        "E": [
          "47421",
          [
            [
              30,
              "MW",
              "100 Veterinary Teaching Hospital",
              3,
              [
                "Gray, S",
                "Gutierrez Nibeyro, S",
                "Madsen, L"
              ],
              -1,
              -1,
              -1
            ]
          ],
          2,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Covers equine lameness from a clinician's perspective. Offers an in-depth integrative approach to the diagnosis of equine lameness using the presenting complaint as a starting point. Rather than approaching equine musculoskeletal disease from the perspective of specific injuries, students will be guided through the lameness examination process. Active student participation in class discussion is expected.",
      []
    ],
    "VCM 625": [
      "Zoological Companion Mammal Medicine",
      {
        "A": [
          "45068",
          [
            [
              30,
              "W",
              "E-080 Veterinary Teaching Hospital",
              3,
              [
                "Borsdorf, M",
                "Lewis, S",
                "Marrow, J",
                "Sander, W",
                "Sosa Higareda, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Zoological Companion Mammal Medicine is an elective course for veterinary students in their third year of the veterinary curriculum or graduate students. Students will learn clinical aspects of comparative anatomy, physiology, husbandry and handling of zoological companion mammal species encountered in companion zoological practice including rodents (Guinea Pigs, rats, hamsters, chinchillas), lagomorph (domestic rabbit), marsupials (sugar glider), carnivores (ferret), and more (African pygmy hedgehogs). The most commonly encountered diseases of these species will also be discussed.",
      []
    ],
    "VCM 645": [
      "Equine Surgery Laboratory",
      {
        "B": [
          "58170",
          [
            [
              121,
              "R",
              "Location Pending",
              3,
              [
                "Gray, S",
                "Gutierrez Nibeyro, S",
                "McCoy, A"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          10,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides introductory laboratory experiences in common and basic equine surgical techniques. Topics include normal and cryptorchid equine castration, distal limb surgeries, casting techniques, and joint injections.",
      []
    ],
    "VCM 641": [
      "Equine Neonatology",
      {
        "E": [
          "58171",
          [
            [
              30,
              "F",
              "250 Veterinary Teaching Hospital",
              3,
              [
                "Austin, S",
                "Wilkins, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ],
        "G": [
          "62865",
          [
            [
              30,
              "F",
              "250 Veterinary Teaching Hospital",
              3,
              [
                "Austin, S",
                "Wilkins, P"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to familiarize the veterinary student with the basic and advanced principles of equine neonatology. Topics include normal and abnormal physiology, problems of the mare that impact the foal, prematurity, sepsis, uremia, musculoskeletal problems, and therapy.",
      []
    ],
    "VCM 663": [
      "Small Animal Dermatology",
      {
        "AL1": [
          "37696",
          [
            [
              27,
              "R",
              "E-080 Veterinary Teaching Hospital",
              3,
              [
                "Bruner, S",
                "Souza, C"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          10,
          0,
          [],
          -1
        ]
      },
      [],
      "First half of the course presents a systematic approach to small animal dermatologic diagnoses and therapeutics; the second half deals with immunological disorders, seborrheic syndromes, hereditary disorders, cutaneous neoplasms, and feline dermatology.",
      []
    ],
    "VCM 667": [
      "Ethics and Conflict in Zoological Medicine",
      {
        "A": [
          "71421",
          [
            [
              15,
              "MW",
              "1261 Vet Med Basic Sciences Bldg",
              3,
              [
                "Desmond, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Provides students with an analytical framework and critical thinking tools to better understand both sides of charismatic and hotly debated issues in Zoological Medicine. An emphasis will be placed on the broader social contexts and the influence of the media on the public perception of these issues. By building these tools early in their career, students will be equipped to better understand and critique arguments for future issues as they develop. Course topics will include maintenance of zoological species as companion animals, management of zoological species in an institution, zoo animal advocacy, intervention of free ranging wildlife, and how a zoo veterinarian is portrayed in public platforms.",
      []
    ],
    "VCM 682": [
      "Wildlife Medicine",
      {
        "E1": [
          "49141",
          [
            [
              12,
              "R",
              "ONLINE",
              3,
              [
                "Adamovicz, L",
                "Lewis, S",
                "Sosa Higareda, M"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "An 8-week elective course for veterinary students offered in their second or third year of the veterinary curriculum. Participation in weekly rounds and team meetings, for the purpose of independent study and training, is required. Students will be required to create a blog style report of an interesting case managed by the student's WMC team or a topic that relates to wildlife medicine, rehabilitation, or conservation. Available to VM2 students during the first 8-week terms of the fall term. Available to VM3 students during the first 8-week terms of the spring term.",
      []
    ],
    "VCM 690": [
      "Intro to Food Supply Medicine",
      {
        "E": [
          "60255",
          [
            [
              29,
              "R",
              "1261 Vet Med Basic Sciences Bldg",
              3,
              [
                "Blair, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course is designed to familiarize the student with the basic principles of food supply veterinary medicine. Topics include epidemiologic investigation, veterinary inputs into food supply systems, reproductive aspects associated with production systems and therapeutic standards in food production.",
      []
    ],
    "VCM 673": [
      "Companion Animal Rehab",
      {
        "E": [
          "48771",
          [
            [
              65,
              "T",
              "2258 Vet Med Basic Sciences Bldg",
              3,
              [
                "Knap, K"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          0,
          0,
          [],
          -1
        ]
      },
      [],
      "Series of lectures/discussions focusing on the proper application of companion animal rehabilitation modalities. Designed to give an understanding of the basics of rehabilitation and begin the thought process of implementing rehabilitation in to veterinary medicine.",
      []
    ],
    "VCM 688": [
      "Food Supply Disease Management",
      {
        "E": [
          "60256",
          [
            [
              65,
              "T",
              "2251 Vet Med Basic Sciences Bldg",
              3,
              [
                "Blair, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "This course is designed to familiarize the veterinary student with the principles of disease management of the major body systems in herd situations. The student will be given case examples and opportunities to evaluate and treat diseases of the respiratory and enteric systems as well as multiple periparturient diseases.",
      []
    ],
    "VCM 674": [
      "Equine Exercise Physiology",
      {
        "EG": [
          "64309",
          [
            [
              15,
              "TR",
              "1261 Vet Med Basic Sciences Bldg",
              3,
              [
                "Foreman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ],
        "EV": [
          "53827",
          [
            [
              15,
              "TR",
              "1261 Vet Med Basic Sciences Bldg",
              3,
              [
                "Foreman, J"
              ],
              -1,
              -1,
              -1
            ]
          ],
          1,
          1,
          0,
          [],
          -1
        ]
      },
      [],
      "Designed to familiarize veterinary students with the basic principles of equine exercise, physiology and sports medicine. Topics include physiology, energetics, thermoregulation, fatigue, conventional and alternate training techniques, and drugs and medications used in equine athletes.",
      []
    ],
    "VCM 694": [
      "Veterinary Clinical Medicine",
      {
        "A": [
          "41707",
          [
            [
              40,
              "T",
              "Location Pending",
              3,
              [
                "Aldridge, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          1,
          0,
          [],
          -1
        ],
        "ONL": [
          "41708",
          [
            [
              65,
              "T",
              "ONLINE",
              3,
              [
                "Aldridge, B"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          7,
          0,
          [],
          -1
        ]
      },
      [],
      "To be used to designate a trial or experimental course for five or more students, designed to be an elective in the CVM professional curriculum. The course can be taught under this designation for two years or two offerings, whichever time is greater.",
      []
    ],
    "VCM 692": [
      "Special Problems",
      {
        "": [
          "10315",
          [
            [
              4,
              "",
              "ONLINE",
              3,
              [
                "Staff"
              ],
              -1,
              -1,
              -1
            ]
          ],
          3,
          2,
          0,
          [],
          -1
        ]
      },
      [],
      "Individual research on a special problem chosen in consultation with the instructor and department head.",
      []
    ]
  },
  "caches": {
    "periods": [
      "1200 - 1320",
      "1500 - 1750",
      "1330 - 1550",
      "0930 - 1150",
      "0000 - 0000",
      "1400 - 1620",
      "1530 - 1750",
      "1730 - 1850",
      "1230 - 1350",
      "1400 - 1520",
      "1530 - 1650",
      "0930 - 1050",
      "1200 - 1250",
      "1000 - 1050",
      "1400 - 1450",
      "1500 - 1550",
      "1100 - 1220",
      "1100 - 1150",
      "1300 - 1350",
      "0900 - 0950",
      "1400 - 1515",
      "1530 - 1620",
      "1600 - 1650",
      "1000 - 1150",
      "1600 - 1850",
      "0900 - 1150",
      "1300 - 1550",
      "0900 - 1050",
      "1100 - 1250",
      "1300 - 1450",
      "1500 - 1650",
      "1530 - 1720",
      "1400 - 1550",
      "1100 - 1215",
      "1000 - 1120",
      "1500 - 1720",
      "0800 - 0920",
      "1430 - 1550",
      "1330 - 1450",
      "1600 - 1715",
      "1200 - 1350",
      "0900 - 1130",
      "0930 - 1130",
      "0900 - 1020",
      "1000 - 1130",
      "1400 - 1650",
      "1500 - 1730",
      "0900 - 1140",
      "0930 - 1045",
      "1230 - 1345",
      "0800 - 0850",
      "1530 - 1645",
      "1700 - 1815",
      "0800 - 0915",
      "1700 - 1750",
      "1900 - 2020",
      "1600 - 1720",
      "0930 - 1020",
      "1800 - 2030",
      "1400 - 1540",
      "1800 - 1920",
      "1530 - 1710",
      "1200 - 1420",
      "1500 - 1800",
      "0800 - 0950",
      "1600 - 1750",
      "1800 - 1950",
      "1600 - 1820",
      "1200 - 1450",
      "1100 - 1350",
      "0800 - 1050",
      "0830 - 1020",
      "1800 - 2050",
      "1300 - 1650",
      "1320 - 1450",
      "1300 - 1420",
      "1530 - 1820",
      "1300 - 1500",
      "1300 - 1415",
      "0900 - 1015",
      "1500 - 1615",
      "1800 - 1930",
      "1945 - 2115",
      "0900 - 1000",
      "1500 - 1700",
      "1500 - 1645",
      "1300 - 1445",
      "1800 - 1945",
      "1800 - 2000",
      "1830 - 2000",
      "1900 - 2030",
      "1300 - 1430",
      "1700 - 1950",
      "1230 - 1320",
      "1700 - 1820",
      "1900 - 2050",
      "1230 - 1420",
      "1030 - 1150",
      "1700 - 1850",
      "1000 - 1230",
      "1730 - 1900",
      "1030 - 1215",
      "1500 - 1620",
      "0830 - 0950",
      "1115 - 1235",
      "1330 - 1520",
      "0900 - 0930",
      "1110 - 1230",
      "0940 - 1100",
      "1400 - 1700",
      "1800 - 2200",
      "1030 - 1220",
      "1000 - 1250",
      "1520 - 1650",
      "1330 - 1630",
      "1000 - 1350",
      "1130 - 1420",
      "1000 - 1220",
      "1600 - 1700",
      "1730 - 1930",
      "0700 - 0750",
      "0800 - 1150"
    ],
    "dateRanges": [],
    "scheduleTypes": [
      "Lecture-Discussion",
      "Lecture",
      "Independent Study",
      "Discussion/ Recitation",
      "Laboratory",
      "Online Lecture",
      "Conference",
      "Online",
      "Seminar",
      "Internship",
      "Laboratory-Discussion",
      "Practice",
      "Research",
      "Study Abroad",
      "Online Lecture Discussion",
      "Travel"
    ],
    "campuses": [],
    "attributes": [],
    "restrictions": [],
    "gradeBases": [],
    "locations": [
      {
        "lat": 40.1035833,
        "long": -88.228405
      },
      {
        "lat": 40.1047599,
        "long": -88.2319514
      },
      {
        "lat": 40.107534,
        "long": -88.2281548
      },
      {
        "lat": null,
        "long": null
      },
      {
        "lat": 40.0995003,
        "long": -88.223104
      },
      {
        "lat": 40.1028373,
        "long": -88.2251326
      },
      {
        "lat": 40.10628,
        "long": -88.22621
      },
      {
        "lat": 40.1065684,
        "long": -88.2281746
      },
      {
        "lat": 40.105732,
        "long": -88.2281018
      },
      {
        "lat": 40.1083446,
        "long": -88.2282555
      },
      {
        "lat": 40.1020773,
        "long": -88.2296394
      },
      {
        "lat": 40.1109722,
        "long": -88.2282631
      },
      {
        "lat": 40.11246109008789,
        "long": -88.22831726074219
      },
      {
        "lat": 40.104794,
        "long": -88.224264
      },
      {
        "lat": 40.1108856,
        "long": -88.2269806
      },
      {
        "lat": 40.1072225,
        "long": -88.2262016
      },
      {
        "lat": 40.1034533,
        "long": -88.2327596
      },
      {
        "lat": 40.1131317,
        "long": -88.2264552
      },
      {
        "lat": 40.1149296,
        "long": -88.2280589
      },
      {
        "lat": 40.1110937,
        "long": -88.2232348
      },
      {
        "lat": 40.1033599,
        "long": -88.2292111
      },
      {
        "lat": 40.111691,
        "long": -88.2242511
      }
    ],
    "finalDates": [],
    "finalTimes": []
  }
}